desafio-13/tests/Artillery_ConsoleLog.txt
$ artillery quick --count 50 -n 20 http://localhost:8080/infocl
Phase started: unnamed (index: 0, duration: 1s) 03:24:48(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 03:24:49(-0300)

--------------------------------------
Metrics for period to: 03:24:50(-0300) (width: 0.993s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 1000/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  median: ...................................................................... 0
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 12.4
  max: ......................................................................... 63.6
  median: ...................................................................... 16
  p95: ......................................................................... 34.1
  p99: ......................................................................... 49.9


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 03:24:52(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 1000/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  median: ...................................................................... 0
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 12.4
  max: ......................................................................... 63.6
  median: ...................................................................... 16
  p95: ......................................................................... 34.1
  p99: ......................................................................... 49.9