desafio-13/tests/Artillery_Sin_ConsoleLog.txt
$ artillery quick --count 50 -n 20 http://localhost:8080/info
Phase started: unnamed (index: 0, duration: 1s) 03:23:42(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 03:23:43(-0300)

--------------------------------------
Metrics for period to: 03:23:50(-0300) (width: 0.993s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 1000/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 8
  median: ...................................................................... 0
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 12.9
  max: ......................................................................... 88.3
  median: ...................................................................... 17.3
  p95: ......................................................................... 74.4
  p99: ......................................................................... 82.3


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 03:23:46(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 1000/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 8
  median: ...................................................................... 0
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 12.9
  max: ......................................................................... 88.3
  median: ...................................................................... 17.3
  p95: ......................................................................... 74.4
  p99: ......................................................................... 82.3